In [2]:
import pandas as pd
import numpy as np

In [3]:
people = {
    'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'], 
    'last': ['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}

In [ ]:
df = pd.DataFrame(people)

# this it the way to handle custom missing values
df.replace('NA', np.nan,inplace=True)
df.replace('Missing', np.nan,inplace=True)

In [ ]:
# HANDLING MISSING DATA

In [11]:

df.dropna()

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@email.com  55
2   John      Doe        JohnDoe@email.com  63

In [12]:
#  on axis if you use index it will drop rows with missing value
# if you use column then it will drop column
#  on how argument you can use (all/any) 
# if you use any then it will drop the entire row if there is any missing value
#  if u use all the row will be droped if all values are missing 
# by defaulf axis is index and how is set to any
df.dropna(axis='index', how='all')

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
5   None      NaN      Anonymous@email.com  None

In [9]:
# drop a row with a specific empty field using subset
#  how arg here is not doing anything
df.dropna(axis='index', how='any',  subset=['email'])

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
5   None      NaN      Anonymous@email.com  None

In [ ]:
# multiple col in subset
# here how is checking on thos col
df.dropna(axis='index', how='all',  subset=['last','email'],inplace=True)

In [13]:
# check if data is classfied as nan or not
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [ ]:
#  filling nan values with some values
# this will replace nan fields with the specified value
df.fillna('MISSING')

In [ ]:
# casting dataTypes (see datatypes)

In [ ]:
df.dtypes

In [ ]:
# this wont work because age is not a number
df['age'].mean()

In [22]:
# converting col dataType
# here we fonverted to float not int bcz converting nan values to int will give an error
#  but nan values are consirered float
# you can check using type(np.nan)

df['age'] = df['age'].astype(float)

In [ ]:
df.dtypes

In [24]:
# this will work
df['age'].mean()

np.float64(46.75)

In [ ]:
#  converting the entire df at once
# cz we have mixed data it wont work but thats how its done
df.astype(int)